Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/cap07-omegat.tmx
Source language: ca
Languages: es_es

source: Un llenguatge controlat té sovint associat un conjunt de programes de suport que ajuden a avaluar i escriure documents que en complisquen les restriccions. L'escriptor de llenguatges controlats usa normalment un editor de textos intel·ligent que fa les següents tasques: Comprovar el compliment de les restriccions terminològiques (per a això, pot ser útil accedir a una base de dades terminològica, com les esmentades en el capítol ), sintàctiques (fent l'anàlisi sintàctica ---vegeu la secció --- i resolent les ambigüitats que hi apareguen), semàntiques i d'estil (per exemple, restringint el format de les dades). Emetre un missatge d'error el més informatiu possible quan detecta una violació de les especificacions del llenguatge. Proposar a la persona usuària formes alternatives vàlides al text erroni. Com es pot veure, els desenvolupaments tècnics fets al voltant del disseny d'un llenguatge controlat es relacionen amb molts conceptes que es tracten en aquest llibre.
es_es: Un lenguaje controlado tiene a menudo asociado un conjunto de programas de apoyo que ayudan a evaluar y escribir documentos que cumplan las restricciones. El escritor de lenguajes controlados usa normalmente un editor de textos inteligente que hace las siguientes tareas: Comprobar el cumplimiento de las restricciones terminológicas (para lo cual, puede ser útil acceder a una base de datos terminológica, como las mencionadas en el capítulo ), sintácticas (haciendo el análisis sintáctico ---veáis la sección --- y resolviendo las ambigüedades que aparezcan), semánticas y de estilo (por ejemplo, restringiendo el formato de los datos). Emitir un mensaje de error lo más informativo posible cuando detecta una violación de las especificaciones del lenguaje. Proponer a la persona usuaria formas alternativas válidas al texto erróneo. Cómo se puede ver, los desarrollos técnicos hechos alrededor del diseño de un lenguaje controlado se relacionan con muchos conceptos que se tratan en este libro.

source: {} amb memòria de traducció. {} per a la disseminació. {} per a l'assimilació.
es_es: {} con memoria de traducción. {} para la diseminación. {} para la asimilación.

source: Un altre exemple clàssic de llenguatge controlat és PACE ({ Perkins-approved controlled English}), l'anglés controlat usat per la companyia de motors Diesel Perkins, concebut especialment per a facilitar la traducció automàtica dels manuals que descriuen les característiques i el manteniment d'aquests motors {newton92b}. Altres exemples de llenguatges controlats són l'ScaniaSwedish usat per la firma de camions i autobusos Scania {almqvist96p}, o el { Caterpillar Technical English} de la companyia de maquinària d'excavació Caterpillar.
es_es: Otro ejemplo clásico de lenguaje controlado es PACE ({ Perkins-approved controlled English}), el inglés controlado usado por la compañía de motores Diesel Perkins, concebido especialmente para facilitar la traducción automática de los manuales que describen las características y el mantenimiento de estos motores {newton92b}. Otros ejemplos de lenguajes controlados son el ScaniaSwedish usado por la firma de camiones y autobuses Scania {almqvist96p}, o el { Caterpillar Technical English} de la compañía de maquinaria de excavación Caterpillar.

source: Quin dels següents no és un avantatge dels llenguatges controlats? S'evita la necessitat que una persona interaccione amb el programa de traducció automàtica per a resoldre ambigüitats durant la traducció. Els textos meta resultants són molt més curts. Els textos origen es fan més intel·ligibles.
es_es: ¿Cuál de los siguientes no es una ventaja de los lenguajes controlados? Se evita la necesidad que una persona interaccione con el programa de traducción automática para resolver ambigüedades durante la traducción. Los textos meta resultantes son mucho más cortos. Los textos origen se hacen más inteligibles.

source: La traducció automàtica per a la disseminació és especialment eficient quan només es tradueixen textos pertanyents a una part molt reduïda i ben regulada de l'idioma en qüestió (un subllenguatge). Un exemple n'és TAUM Méteo, el sistema que produeix informes meteorològics simultanis en francés i en anglés al Canadà des de fa més de vint anys.
es_es: La traducción automática para la diseminación es especialmente eficiente cuando sólo se traducen textos pertenecientes a una parte muy reducida y muy regulada del idioma en cuestión (un subllenguatge). Un ejemplo es TAUM Méteo, el sistema que produce informes meteorológicos simultáneos en francés y en inglés en Canadá desde hace más de veinte años.

source: Imagineu que un traductor professional cobra 0,05 euros per mot de text traduït i que un corrector de textos cobra 0,10 euros per mot de text corregit. Imagineu que tenim un sistema de traducció automàtica que ens costa uns 0,03 euros per mot traduït i que produeix un 10% de mots incorrectes en les traduccions. Convé adoptar-lo i contractar el corrector o és millor contractar el traductor professional? (si no sabeu calcular-ho en general, feu els càlculs amb un text de, per exemple, 1000 mots).
es_es: Imaginad que un traductor profesional cobra 0,05 euros por palabra de texto traducido y que un corrector de textos cobra 0,10 euros por palabra de texto corregido. Imaginad que tenemos un sistema de traducción automática que nos cuesta unos 0,03 euros por palabra traducida y que produce un 10% de palabras incorrectas en las traducciones. ¿Conviene adoptarlo y contratar el corrector o es mejor contratar el traductor profesional? (si no sabéis calcularlo en general, haced los cálculos con un texto de, por ejemplo, 1000 palabras).

source: Moltes voltes, la preedició la fa l'autor quan interacciona amb el programa de traducció automàtica. És possible dissenyar un sistema de preedició interactiva per a autors monolingües? Sí. No. Per a preeditar correctament cal conéixer l'idioma de destinació. Només per a certs idiomes amb estructura gramatical senzilla com l'anglés.
es_es: Muchas veces, la preedición la hace el autor cuando interacciona con el programa de traducción automática. ¿Es posible diseñar un sistema de preedición interactiva para autores monolingües? Sí. No. Para preeditar correctamente hay que conocer el idioma de destino. Sólo para ciertos idiomas con estructura gramatical sencilla como el inglés.

source: {} amb preedició. {} per a la disseminació. {} per a l'assimilació.
es_es: {} con preedición. {} para la diseminación. {} para la asimilación.

source: Si un angloparlant usa el traductor automàtic portugués--anglés de |babelfish.altavista.com| per a llegir en línia el diari brasileny O Globo, està usant la traducció automàtica per a un propòsit
es_es: Si un angloparlante usa el traductor automático portugués--inglés de |babelfish.altavista.com| para leer en línea el diario brasileño O Globo, está usando la traducción automática para un propósito

source: No, perquè els homògrafs del text origen no afecten el text meta en brut. No, perquè només estem mirant el text meta. Sí, perquè són una font molt important d'errors especialment difícils de corregir si no es coneix què ha passat.
es_es: No, porque los homógrafos del texto origen no afectan el texto meta en bruto. No, porque sólo estamos mirando el texto meta. Sí, porque son una fuente muy importante de errores especialmente difíciles de corregir si no se conoce qué ha pasado.

source: Preedició i postedició
es_es: Preedición y postedición

source: L'ús d'un llenguatge controlat L'ús d'un sistema d'interlingua. La postedició sistemàtica Frans consulta a través d'Internet la base de dades terminològica Eurodicautom quan tradueix dossiers antiglobalització de l'anglés al neerlandés. En quina de les tres situacions següents es troba?
es_es: El uso de un lenguaje controlado El uso de un sistema de interlingua. La postedición sistemática Frans consulta a través de Internet la base de datos terminológica Eurodicautom cuando traduce dosieres antiglobalización del inglés al neerlandés. ¿En cuál de las tres situaciones siguientes se encuentra?

source: Per què és necessària la preedició en els sistemes de traducció automàtica? Per a evitar construccions o frases difícils de traduir. Perquè el format quede més agradable a la vista. És una alternativa a la postedició.
es_es: ¿Por qué es necesaria la preedición en los sistemas de traducción automática? Para evitar construcciones o frases difíciles de traducir. Para que el formato quede más agradable a la vista. Es una alternativa a la postedición.

source: {Disseminació} Per altra banda, en situacions de disseminació de la informació, pot ser útil restringir la llengua d'origen (no permetre'n totes les realitzacions possibles, ni tot el lèxic, ni tots els registres) a un llenguatge que puga ser traduït automàticament amb el mínim possible de problemes, és a dir, amb el mínim esforç de postedició, o almenys, amb un esforç acceptable per un revisor. Açò és especialment important quan es tracta de traduir manuals tècnics a diversos idiomes. Les restriccions es poden expressar sota la forma de missatges interactius dirigits a la persona que prepara el document original.
es_es: {Diseminación} Por otro lado, en situaciones de diseminación de la información, puede ser útil restringir la lengua de origen (no permitir todas las realizaciones posibles, ni todo el léxico, ni todos los registros) a un lenguaje que pueda ser traducido automáticamente con el mínimo posible de problemas, es decir, con el mínimo esfuerzo de postedición, o al menos, con un esfuerzo aceptable por un revisor. Esto es especialmente importando cuando se trata de traducir manuales técnicos a varios idiomas. Las restricciones se pueden expresar bajo la forma de mensajes interactivos dirigidos a la persona que prepara el documento original.

source: {} postedició. {} traducció automàtica assistida per la persona. {} traducció humana assistida per l'ordinador.
es_es: {} postedición. {} traducción automática asistida por la persona. {} traducción humana asistida por el ordenador.

source: Imagineu que podem elegir entre dos sistemes de traducció automàtica diferent $t_A$ i $t_B$ per a traduir manuals de televisors de l'anglés al francés, i que s'ha de dissenyar un anglés controlat per a minimitzar la postedició. Les regles de l'anglés controlat, poden dependre del sistema de TA elegit? No, perquè els llenguatges controlats s'han de dissenyar independentment dels sistemes de TA. Sí, perquè en cada cas s'han d'evitar problemes diferents. No, perquè la llengua meta dels dos sistemes és la mateixa.
es_es: Imaginad que podemos elegir entre dos sistemas de traducción automática diferente $t_A$ y $t_B$ para traducir manuales de televisores del inglés al francés, y que se tiene que diseñar un inglés controlado para minimizar la postedición. Las reglas del inglés controlado, ¿pueden depender del sistema de TA elegido? No, porque los lenguajes controlados se tienen que diseñar independientemente de los sistemas de TA. Sí, porque en cada caso se tienen que evitar problemas diferentes. No, porque la lengua meta de los dos sistemas es la misma.

source: {HAMT:} Un programa de traducció automàtica pregunta a l'usuari quan té més d'una possible traducció per a un mot o per a una frase. Aquesta i altres situacions de negociació del text d'origen amb l'usuari del sistema impliquen una interacció que també pot ajudar a preparar un text més correcte, és a dir, a preeditar-lo perquè puga ser traduït automàticament. Altres voltes, el programa pot analitzar l'estructura profunda de la frase i presentar-ne les possibles interpretacions a l'autor, per tal que resolga alguna possible ambigüitat. En aquests sistemes interactius, cal tenir en compte dos factors: el primer, que un sistema que pregunta massa no és còmode d'usar (no és ergonòmic) i el segon, que pot passar que l'usuari siga monolingüe, circumstància que canvia molt la naturalesa de la interacció entre el programa i l'usuari. Els usuaris d'aquest tipus de sistemes es podrien classificar en tres grans grups: traductors ocasionals, traductors professionals individuals i traductors professionals que treballen per a empreses de traducció.
es_es: {HAMT:} Un programa de traducción automática pregunta al usuario cuando tiene más de una posible traducción para una palabra o para una frase. Esta y otras situaciones de negociación del texto de origen con el usuario del sistema implican una interacción que también puede ayudar a preparar un texto más correcto, es decir, a preeditarlo para que pueda ser traducido automáticamente. Otras veces, el programa puede analizar la estructura profunda de la frase y presentar las posibles interpretaciones al autor, para que resuelva alguna posible ambigüedad. En estos sistemas interactivos, hay que tener en cuenta dos factores: el primero, que un sistema que pregunta demasiado no es cómodo de usar (no es ergonómico) y el segundo, que puede pasar que el usuario sea monolingüe, circunstancia que cambia mucho la naturaleza de la interacción entre el programa y el usuario. Los usuarios de este tipo de sistemas se podrían clasificar en tres grandes grupos: traductores ocasionales, traductores profesionales individuales y traductores profesionales que trabajan para empresas de traducción.

source: {Assimilació} Per una banda, en situacions d'{ assimilació} de la informació no sembla necessària una traducció perfecta, sinó més aviat una traducció ràpida i raonablement intel·ligible. És el cas de la traducció de correu electrònic, de documents d'Internet (durant la navegació) o de despatxos de premsa en altres idiomes. Una altra aplicació d'assimilació de la informació és l'anomenat screening o exploració de documents per a decidir quins són rellevants i mereixen una atenció més detallada; de fet, aquesta va ser una de les primeres aplicacions de la traducció automàtica als EUA: es volia tenir accés a la informació tecnològica present en documents de la Unió Soviètica. Els usos civils de l'screening han superat actualment l'ús tradicional, el militar. En el cas de l'screening, fins i tot una traducció incompleta a més d'incorrecta (per exemple, només dels mots terminològics) pot ser de gran utilitat. L'screening es pot fer usant un ordinador personal tot sol, o accedint a ordinadors servidors d'informació, en el cas de grans instal·lacions. És important indicar que en quasi totes les situacions d'assimilació el paper del traductor professional és inexistent, ja que el treball és de naturalesa molt diferent, i l'ús d'un traductor professional seria molt car i molt lent. Una altra aplicació interessant és la traducció automàtica de converses electròniques (usant el teclat i la pantalla d'ordinadors connectats entre si) entre persones que parlen dos idiomes diferents. Les imperfeccions de la traducció es poden compensar amb preguntes o dient les coses d'una altra manera fins que els dos interlocutors s'entenguen (és a dir, mitjançant una negociació).
es_es: {Asimilación} Por un lado, en situaciones de { asimilación} de la información no parece necesaria una traducción perfecta, sino más bien una traducción rápida y razonablemente inteligible. Es el caso de la traducción de correo electrónico, de documentos de Internet (durante la navegación ) o de despachos de prensa en otros idiomas. Otra aplicación de asimilación de la información es el llamado screening o exploración de documentos para decidir cuáles son relevantes y merecen una atención más detallada; de hecho, esta fue una de las primeras aplicaciones de la traducción automática en los EE.UU.: se quería tener acceso a la información tecnológica presente en documentos de la Unión Soviética. Los usos civiles del screening han superado actualmente el uso tradicional, el militar. En el caso del screening, incluso una traducción incompleta además de incorrecta (por ejemplo, sólo de las palabras terminológicas) puede ser de gran utilidad. El screening se puede hacer usando un ordenador personal a solas, o accediendo a ordenadores servidores de información, en el caso de grandes instalaciones. Es importante indicar que en casi todas las situaciones de asimilación el papel del traductor profesional es inexistente, puesto que el trabajo es de naturaleza muy diferente, y el uso de un traductor profesional seria muy caro y muy lento. Otra aplicación interesante es la traducción automática de conversaciones electrónicas (usando el teclado y la pantalla de ordenadores conectados entre sí) entre personas que hablan dos idiomas diferentes. Las imperfecciones de la traducción se pueden compensar con preguntas o diciendo las cosas de otro modo hasta que los dos interlocutores se entiendan (es decir, mediante una negociación).

source: Llengua de contacte que es parla a Papua Nova Guinea i que té 50.000 parlants que la parlen com a primera llengua i més de dos milions de parlants que la parlen com a segona llengua.
es_es: Lengua de contacto que se habla en Papúa Nueva Guinea y que tiene 50.000 hablantes que la hablan como primera lengua y más de dos millones de hablantes que la hablan como segunda lengua.

source: [Solució 2 (1000 mots):] El traductor professional tradueix un text de 1000 mots per 0,05$$1000$=$50 euros. El sistema de traducció automàtica el tradueix per 0,03$$1000$=$30 euros, i corregir-lo costa 10 euros, perquè en 1000 parules hi ha 1000$ $10$/$100$=$100 mots incorrectes i corregir cada un costa 0,10 euros: 0,10$$100$=$10. Per tant, el sistema semiautomàtic costa només 40 euros, davant dels 50 del traductor professional.
es_es: [Solución 2 (1000 palabras):] El traductor profesional traduce un texto de 1000 palabras por 0,05$$1000$=$50 euros. El sistema de traducción automática lo traduce por 0,03$$1000$=$30 euros, y corregirlo cuesta 10 euros, porque en 1000 palabras hay 1000$ $10$/$100$=$100 palabras incorrectas y corregir cada una cuesta 0,10 euros: 0,10$$100$=$10. Por lo tanto, el sistema semiautomático cuesta sólo 40 euros, ante los 50 del traductor profesional.

source: L'adopció d'un llenguatge controlat en una situació de traducció de documents d'una llengua a moltes llengües per a la disseminació és, en el procés complet, una alternativa a{} {}la postedició repetitiva dels documents meta. {}la preedició repetitiva dels documents origen. {}la traducció de fragments ja traduïts anteriorment.
es_es: La adopción de un lenguaje controlado en una situación de traducción de documentos de una lengua a muchas lenguas para la diseminación es, en el proceso completo, una alternativa a la{} {}postedición repetitiva de los documentos meta. {}la preedición repetitiva de los documentos origen. {}la traducción de fragmentos ya traducidos anteriormente.

source: {} HAMT. {} MAHT. {} un sistema de traducció automàtica ergonòmic.
es_es: {} HAMT. {} MAHT. {} un sistema de traducción automática ergonómico.

source: Un sistema que suggereix millores a l'estil d'un document es pot considerar com {}
es_es: Un sistema que sugiere mejoras al estilo de un documento se puede considerar cómo {}
